workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияСтатусовАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияСтатусовАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукСтатусыАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПриемеСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПриемеОтказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить_УведомлениеОЗавершенииЭтапаАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПромежуточномПобедителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПобеде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОНачалеАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростоеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкеНачалаАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПровереПереходаКПодведениюПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеКПодведениюПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкиПодведенияПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПровереПереходаКПодведениюИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеКПодведениюИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПроверкеПодведенияИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбОтменеАукциона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПереходеНаНовыйЭтапБезПодведенияПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОЗавершенииАукционаБезПодведенияИтогов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Catalogs/АукУчастникиАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукУчастникиАукционов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыАукционов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАукциона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАукциона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/Catalogs/АукАукционы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Справочник_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Справочник_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Справочник_ПриОткрытии(ЭтотОбъект, Отказ);
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;

	ЗаполнитьСписокВыбораУчастников();
	
	НастроитьИнтерфейсПоУсловиям();
	
	ПодпискиНаСобытияФормКлиент.Справочник_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеМодифицированы",	Модифицированность);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)	
	ЭтотОбъект.КоличествоСнимков = Справочники.АукАукционы.КоличествоСнимковТекущегоАукциона(Объект.Ссылка);
	
	ПроинформироватьУчастниковОбИзмененииКоличестваЭтапов()
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьГиперссылкуИсторииИзменений();
	
	ОбновитьГиперссылкиАвторов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьКонтактныеЛица" Тогда
		
		масСтрокиТч = Объект.Участники.НайтиСтроки(Новый Структура("Участник", Параметр));
		
		АукОбщийКлиентСервер.ОбновитьОтборКонтактныхЛицДляВсехУчастников(масСтрокиТч, Объект.ВидАукциона);
			
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура ВидАукционаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	сткРез = ПроверитьЗаполнениеДанныхПередИзменениемВидаАукциона();
	
	Если Не сткРез.Успех Тогда 	
		Оповещение = Новый ОписаниеОповещения("ВидАукционаНачалоВыбораВопрос_Продолжить", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, сткРез.Результат, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));	
	Иначе		
		ОткрытьФормуВыбораВидаАукциона();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАукционаНачалоВыбораВопрос_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОткрытьФормуВыбораВидаАукциона();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАукционаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
		
	ОбработкаВыбораВидаАукциона(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидАукционаОчистка(Элемент, СтандартнаяОбработка)
	ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	ОбработкаВыбораВидаАукциона(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура тзНачальныеДанныеДинамическаяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	НовСтрока = ЭтотОбъект.тзНачальныеДанныеДинамическая.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
	
	Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
		НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура тзНачальныеДанныеДинамическаяПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура тзНачальныеДанныеДинамическаяУчастникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.тзНачальныеДанныеДинамическая.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", СписокУникальныхУчастников()));
		
		Оповещение = Новый ОписаниеОповещения("НачальныеДанныеВыборУчастника_Продолжить", ЭтотОбъект, ТекДанные);
		
		ОткрытьФорму("Справочник.АукУчастникиАукционов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачальныеДанныеВыборУчастника_Продолжить(Результат, ТекДанные) Экспорт

	Если Результат <> Неопределено Тогда
		
		ТекДанные.Участник = Результат;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИКонтактыУчастникПриИзменении(Элемент)
	
	ОбновитьОтборКонтактныхЛиц();	
			
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИКонтактыУчастникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ТекДанные = Элементы.УчастникиИКонтакты.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ТекДанные.Участник <> ВыбранноеЗначение Тогда 
		
		ТекДанные.КонтактноеЛицо = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаИсторияИзмененийНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ТекущийАукцион", Объект.Ссылка));
	
	ОткрытьФорму("Справочник.АукАукционы.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИКонтактыКонтактноеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	сткОтбор = Новый Структура("КонтактноеЛицо", ВыбранноеЗначение); 
	
	Если Объект.Участники.НайтиСтроки(сткОтбор).Количество() <> 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаНачальныеДанные" Тогда
		
		ЗаполнитьСписокВыбораУчастников();
		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИКонтактыКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекДанные = Элементы.УчастникиИКонтакты.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("МожноСоздаватьЭлементы", Ложь);
		
		НастройкиКД = Новый НастройкиКомпоновкиДанных;
		
		ЭлементОтбора = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ПравоеЗначение	= ТекДанные.КонтактныеЛицаОтбор;
		ЭлементОтбора.Использование		= Истина; 
		
		ПараметрыФормы.Вставить("ФиксированныеНастройки", НастройкиКД);
		
		Оповещение = Новый ОписаниеОповещения("КонтактноеЛицоВыбор_Продолжить", ЭтотОбъект, ТекДанные);
		
		ОткрытьФорму("Справочник.АукКонтактныеЛицаУчастниковАукционов.ФормаВыбора", ПараметрыФормы, Элемент,,,, Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоВыбор_Продолжить(Результат, пТекДанные) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		сткОтбор = Новый Структура("КонтактноеЛицо", Результат); 
		
		Если Объект.Участники.НайтиСтроки(сткОтбор).Количество() = 0 Тогда
			
			пТекДанные.КонтактноеЛицо = Результат;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиИКонтактыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если АукОбщийКлиентСервер.СтатусЗапрещаетИзменениеДанныхАукциона(ТекущийСтатус)
		 Или АукОбщийКлиентСервер.СтатусРазрешаетЧастичноеИзменениеДанныхАукциона(ТекущийСтатус)
	Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = Объект.Участники.НайтиПоИдентификатору(ВыбраннаяСтрока);
		
		Если Поле.Имя = "УчастникиИКонтактыУчастник" Тогда
			
			ПоказатьЗначение(, ТекДанные.Участник); 
			
		ИначеЕсли Поле.Имя = "УчастникиИКонтактыКонтактноеЛицо" Тогда 
			
			ПоказатьЗначение(, ТекДанные.КонтактноеЛицо);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеПодведениеПромежуточныхИтоговПриИзменении(Элемент)
	Если Объект.АвтоматическоеПодведениеПромежуточныхИтогов Тогда
		Объект.АвтоматическийПереходКПодведениюПромежуточныхИтогов = Истина;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеПодведениеОкончательныхИтоговПриИзменении(Элемент)
	Если Объект.АвтоматическоеПодведениеОкончательныхИтогов Тогда
		Объект.АвтоматическийПереходКПодведениюОкончательныхИтогов = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалением(Элемент, Отказ)
	Отказ = (Элемент.ТекущиеДанные.НомерСтроки <= ЭтотОбъект.ТекущийНомерЭтапа);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриИзменении(Элемент)
	ЭтотОбъект.ДанныеПоЭтапамИзменены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическийПереходКПодведениюПромежуточныхИтоговПриИзменении(Элемент)
	Если Не Объект.АвтоматическийПереходКПодведениюПромежуточныхИтогов Тогда
		Объект.АвтоматическоеПодведениеПромежуточныхИтогов = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическийПереходКПодведениюОкончательныхИтоговПриИзменении(Элемент)
	Если Не Объект.АвтоматическийПереходКПодведениюОкончательныхИтогов Тогда
		Объект.АвтоматическоеПодведениеОкончательныхИтогов = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриАктивизацииСтроки(Элемент)
	УстановитьОтобрыНаПолеВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриАктивизацииПоля(Элемент)
	УстановитьОтобрыНаПолеВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтобрыНаПолеВыбора(пЭлемент)
	ТекДанные = пЭлемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Элементы.ПараметрыЗначениеПараметра.ОграничениеТипа = ТекДанные.ТипЗначения;
		
		АукОбщийКлиент.УстановитьПараметрыОтбораДляЭлементаФормы("Отбор.Владелец", ТекДанные.Параметр, Элементы.ПараметрыЗначениеПараметра);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура УстановитьТекущееВремя(Команда)
	
	Объект.ДатаНачала = НачалоМинуты(ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_() + 60);
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУчастниковПоВиду(Команда)
	ЗаполнитьУчастниковПоВиду();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНачальныеДанныеПоУчастникам(Команда)
	ЗаполнитьНачальныеДанныеПоСпискуУчастников();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКастомная(Команда)
	ПроверитьДанныеПередЗаписью(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭтапыПоУмолчанию1(Команда)
	Если ЗначениеЗаполнено(Объект.ВидАукциона) Тогда
		ЗаполнитьЭтапыПоУмолчанию(Объект.ВидАукциона);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните вид аукциона'"));	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ПроинформироватьУчастниковОбИзмененииКоличестваЭтапов()
	Если ЗначениеЗаполнено(ЭтотОбъект.ТекущийСтатус)
		 И АукОбщийКлиентСервер.СтатусРазрешаетЧастичноеИзменениеДанныхАукциона(ЭтотОбъект.ТекущийСтатус)
		 И ЭтотОбъект.ДанныеПоЭтапамИзменены
	Тогда
		сткПараметрыОтправкиСообщений = Новый Структура;
		сткПараметрыОтправкиСообщений.Вставить("Адресаты",			Справочники.АукАукционы.КонтактныеЛицаСПривязкойКУчастникам(Объект.Ссылка,, Ложь));
		сткПараметрыОтправкиСообщений.Вставить("Аукцион",			Объект.Ссылка);
		сткПараметрыОтправкиСообщений.Вставить("ТекстСообщения",	ТекстСообщенияУчастникамОбИзмененииЭтапов());
		сткПараметрыОтправкиСообщений.Вставить("Автоматическая",	Ложь);
		сткПараметрыОтправкиСообщений.Вставить("ВидСообщения",		ПредопределенноеЗначение("Перечисление.АукВидыСообщений.ПростоеСообщение"));
	
		АукОбщийВызовСервера.ОтправитьСообщениеУчастникам(сткПараметрыОтправкиСообщений);
		
		ЭтотОбъект.ДанныеПоЭтапамИзменены = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстСообщенияУчастникамОбИзмененииЭтапов()
	Возврат "Планируемые этапы аукциона:
			|[АУКЦИОН_ЭТАПЫ]

			|Примерное время завершения аукциона: [АУКЦИОН_ПЛАНИРУЕМОЕ_ВРЕМЯ_ЗАВЕРШЕНИЯ].";	
КонецФункции	

&НаКлиенте
Процедура ПроверитьДанныеПередЗаписью(пБулЭтоЗакрытие)
	// Если включена автоматика (хоть один чекбокс) то делаем весь перечень проверок 
	// Если автоматика выключена, тогда проверки будут только при старте!!!
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьНачальныеДанныеОбъектаИспользуяДанныеФормы();
	
	Если Модифицированность Или Параметры.Ключ.Пустая() Тогда	
		Если АукОбщийКлиентСервер.АвтоматическийРежим(Объект) Или АукОбщийКлиентСервер.СтатусРазрешаетЧастичноеИзменениеДанныхАукциона(ЭтотОбъект.ТекущийСтатус) Тогда
			
			сткДанныеФормы = АукОбщийКлиентСервер.ДанныеАукционаДляПроверки(Объект);
			
			Оповещение = Новый ОписаниеОповещения("ПроверкаПередЗаписью_Продолжить", ЭтотОбъект, пБулЭтоЗакрытие);
			
			АукОбщийКлиент.ВыполнитьПроверкиНастроекАукциона(сткДанныеФормы, Оповещение);
		Иначе	
			НачатьЗаписьИЗакрыть(пБулЭтоЗакрытие);			
		КонецЕсли;
	Иначе
		НачатьЗаписьИЗакрыть(пБулЭтоЗакрытие)	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаписьИЗакрыть(пБулЭтоЗакрытие)
	Записать();
	
	Если пБулЭтоЗакрытие Тогда
		Закрыть();	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаПередЗаписью_Продолжить(Результат, пБулЭтоЗакрытие) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		//Модифицированность = Ложь;
		
		НачатьЗаписьИЗакрыть(пБулЭтоЗакрытие);	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачальныеДанныеПоСпискуУчастников()
	масУчастники = ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(Объект.Участники, "Участник", Истина);
	
	МасСткУчастники = АукОбщийКлиентСервер.МассивЗначенийВМассивСтруктур(масУчастники, "Участник"); 
	
	АукОбщийКлиент.ЗаполнитьТаблицуДаннымиМассиваСтруктур(ЭтотОбъект.тзНачальныеДанныеДинамическая, МасСткУчастники, "Участник");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастниковПоВиду()
	Если ЗначениеЗаполнено(Объект.ВидАукциона) Тогда
		масУчастникиПоВиду = АукОбщийВызовСервера.УчастникиАукционаИИхКонтактныеЛицаПоВидуАукциона(Объект.ВидАукциона);
		
		АукОбщийКлиент.ЗаполнитьТаблицуДаннымиМассиваСтруктур(Объект.Участники, масУчастникиПоВиду, "Участник, КонтактноеЛицо");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните вид аукциона'"));	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборКонтактныхЛиц()
	
	ТекДанные = Элементы.УчастникиИКонтакты.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Участник) Тогда
		
		Если ЗначениеЗаполнено(Объект.ВидАукциона) Тогда	
			
			сооКонтактныеЛицаУчастника = АукОбщийВызовСервера.КонтактныеЛицаУчастникаПоВидуАукциона(ТекДанные.Участник, Объект.ВидАукциона);
			
			АукОбщийКлиентСервер.ЗаполнитьКонтактныеЛицаОтборПоСтроке(ТекДанные, сооКонтактныеЛицаУчастника);
			
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаВыбораВидаАукциона(пСтандартнаяОбработка, пНовыйВидАукциона = Неопределено)
	
	Если ЗначениеЗаполнено(пНовыйВидАукциона) И Объект.ВидАукциона <> пНовыйВидАукциона Тогда 
		
		сткРез = ПроверитьЗаполнениеДанныхПередИзменениемВидаАукциона();
		
		Если Не сткРез.Успех Тогда
			
			пСтандартнаяОбработка = Ложь; 
			
			Оповещение = Новый ОписаниеОповещения("ВидАукционаОбработкаВыбораВопрос_Продолжить", ЭтотОбъект, пНовыйВидАукциона);
			
			ПоказатьВопрос(Оповещение, сткРез.Результат, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));
			
		Иначе	
			ОбновитьИнтефейсПриИзмененииВидаАукциона(пНовыйВидАукциона);	
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(пНовыйВидАукциона) Тогда	
		масТчНаОчистку = Новый Массив;
		Если Объект.Участники.Количество() <> 0 Тогда
			масТчНаОчистку.Добавить("""Участники""");	
		КонецЕсли;
		
		Если ЭтотОбъект.тзНачальныеДанныеДинамическая.Количество() <> 0 Тогда // тч которая на форме это не ТЧ которая объекта
			масТчНаОчистку.Добавить("""НачальныеДанные""");	
		КонецЕсли;
		
		Если Объект.Этапы.Количество() <> 0 Тогда
			масТчНаОчистку.Добавить("""Этапы""");	
		КонецЕсли;
		
		Если масТчНаОчистку.Количество() <> 0 Тогда
			пСтандартнаяОбработка = Ложь; 
			
			Оповещение = Новый ОписаниеОповещения("ВидАукционаОбработкаВыбораВопрос_Продолжить", ЭтотОбъект, пНовыйВидАукциона);
			
			стрВопрос = СтрШаблон(НСтр("ru = 'Табличные части %1 будет очищена. Продолжить?'"), СтрСоединить(масТчНаОчистку, ", "));
			
			ПоказатьВопрос(Оповещение, стрВопрос, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'"));		
		Иначе	
			ОбновитьИнтефейсПриИзмененииВидаАукциона(пНовыйВидАукциона);	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеДанныхПередИзменениемВидаАукциона()
	
	ПустКонтактныеЛицаКол	= Объект.Участники.НайтиСтроки(Новый Структура("КонтактноеЛицо", ПредопределенноеЗначение("Справочник.АукКонтактныеЛицаУчастниковАукционов.ПустаяСсылка"))); 
	УчастникиКол			= Объект.Участники.Количество();
	НачальныеДанныеКол		= ЭтотОбъект.тзНачальныеДанныеДинамическая.Количество(); // тч которая на форме это не ТЧ которая объекта
	
	Если (УчастникиКол <> 0 И УчастникиКол <> ПустКонтактныеЛицаКол) И НачальныеДанныеКол <> 0 Тогда
		
		стрТекстВопроса = НСтр("ru = 'При изменении вида аукциона начальные данные будут очищены, таблица перестроена, перезаполнятся участники. Продолжить?'");
		
	ИначеЕсли УчастникиКол <> 0 И УчастникиКол <> ПустКонтактныеЛицаКол Тогда 
		
		стрТекстВопроса = НСтр("ru = 'При изменении вида аукциона перезаполнятся участники. Продолжить?'");
		
	ИначеЕсли НачальныеДанныеКол <> 0 Тогда 
		
		стрТекстВопроса = НСтр("ru = 'При изменении вида аукциона начальные данные будут очищены, таблица перестроена. Продолжить?'");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрТекстВопроса) Тогда
		
		Возврат ЭдоОбщий._Ошибка(стрТекстВопроса);
		
	Иначе
		
		Возврат ЭдоОбщий._Успех();
		
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ВидАукционаОбработкаВыбораВопрос_Продолжить(Результат, ВыбранноеЗначение) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
				
		ОбновитьИнтефейсПриИзмененииВидаАукциона(ВыбранноеЗначение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтефейсПриИзмененииВидаАукциона(пНовыйВидАукциона)
	ЭтотОбъект.тзНачальныеДанныеДинамическая.Очистить(); // тч которая на форме это не ТЧ которая объекта
	
	ОбновитьИнтефейсПриИзмененииВидаАукционаНаСервере(Объект.ВидАукциона, пНовыйВидАукциона);
	
	//ОбновитьТаблицуПараметров(пНовыйВидАукциона);
	
	УстановитьВидимостьВкладкиНачальныхДанных();
	
	Объект.ВидАукциона = пНовыйВидАукциона;
	
	Объект.Участники.Очистить();
		
	АукОбщийКлиентСервер.ОбновитьОтборКонтактныхЛицДляВсехУчастников(Объект.Участники, Объект.ВидАукциона);
	
	Если Не ЗначениеЗаполнено(Объект.ВидАукциона) Тогда
		Объект.Этапы.Очистить();	
	КонецЕсли;	
	
	Модифицированность = Истина;
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ВидАукциона;
	
	ЭтотОбъект.ТекущиеНастройкиВидаАукциона = Новый ФиксированнаяСтруктура(НастройкиВидаАукциона(Объект.ВидАукциона));
	
	ОбновитьСостояниеФлаговУправленияАвтоматикой();	
	
	НастроитьЭлементыУправленияАвтоматикой();		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеФлаговУправленияАвтоматикой()
	Если Не АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Если Не ЭтотОбъект.ТекущиеНастройкиВидаАукциона.СРаспределениемСуммы Тогда
			Объект.АвтоматическоеПодведениеОкончательныхИтогов = Ложь;	
		КонецЕсли;
		
		Если Не ЭтотОбъект.ТекущиеНастройкиВидаАукциона.ЕстьДанныеДляРасчетаПромежуточногоИтога Тогда
			Объект.АвтоматическоеПодведениеПромежуточныхИтогов = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементыУправленияАвтоматикой()
	Если ЗначениеЗаполнено(ЭтотОбъект.ТекущиеНастройкиВидаАукциона) Тогда	
		Элементы.АвтоматическоеПодведениеОкончательныхИтогов.ТолькоПросмотр = Не ЭтотОбъект.ТекущиеНастройкиВидаАукциона.СРаспределениемСуммы;
		Элементы.АвтоматическоеПодведениеПромежуточныхИтогов.ТолькоПросмотр = Не ЭтотОбъект.ТекущиеНастройкиВидаАукциона.ЕстьДанныеДляРасчетаПромежуточногоИтога;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуВыбораВидаАукциона()

	Оповещение = Новый ОписаниеОповещения("ВыборВидаАукциона_Продолжить", ЭтотОбъект);
		
	ОткрытьФорму("Справочник.АукВидыАукционов.ФормаВыбора",, ЭтотОбъект,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаАукциона_Продолжить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбновитьИнтефейсПриИзмененииВидаАукциона(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИнтерфейсПоУсловиям()	
	ОбновитьГиперссылкуИсторииИзменений();
	
	ОбновитьГиперссылкиАвторов();
		
	НастройкаИнтерфейсаВЗависимостиОтСтатуса();
		
	УстановитьВидимостьВкладкиНачальныхДанных();
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтотОбъект.ТекущийЭлемент = Элементы.Наименование;	
	КонецЕсли;
	
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		Элементы.Сумма.Видимость		= Ложь;
		Элементы.ГруппаСрок.Видимость	= Ложь;
	КонецЕсли;	
КонецПроцедуры

// 1. Если статус аукциона Новый или аукцион сам по себе новый
//		- менять можно всё
// 2. Если статус аукциона НовыйЭтап или ПодведениеПромежуточныхИтогов
//		- нельзя менять состав Участников
//		- можно менять состав начальных данных
//		- можно менять длительность оставшихся этапов, количество ещё несостоявшихся этапов
// 3. Если статус аукциона ПодведениеИтогов, Завершен или Архив Или Если это дочерний аукцион
//		- нельзя ничего менять
//
&НаКлиенте
Процедура НастройкаИнтерфейсаВЗависимостиОтСтатуса()
	Если АукОбщийКлиентСервер.СтатусЗапрещаетИзменениеДанныхАукциона(ТекущийСтатус)
		 Или ЗначениеЗаполнено(Объект.ТекущийАукцион)
	Тогда
		АукОбщийКлиент.УставновитьРежимТолькоПросмотрУВсехЭлементов(ЭтотОбъект);
		
		АукОбщийКлиент.УстановитьВидимостьКоманд(ЭтотОбъект);	
	ИначеЕсли АукОбщийКлиентСервер.СтатусРазрешаетЧастичноеИзменениеДанныхАукциона(ТекущийСтатус) Тогда
		АукОбщийКлиент.УставновитьРежимТолькоПросмотрУВсехЭлементов(ЭтотОбъект,, "Сумма,Срок,Наименование,Комментарий,ГруппаЭтапы,ГруппаНачальныеДанные");
		
		АукОбщийКлиент.УстановитьВидимостьКоманд(ЭтотОбъект,, "ЗаписатьИЗакрытьКастомная,ЗаписатьКастомная,ДобавитьНачальныеДанныеПоУчастникам");
	Иначе
		НастроитьЭлементыУправленияАвтоматикой();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВкладкиНачальныхДанных()
	
	Элементы.ГруппаНачальныеДанные.Видимость = ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами.Количество() <> 0;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГиперссылкиАвторов() 
	
	Если ЗначениеЗаполнено(Объект.Автор) И ЗначениеЗаполнено(Объект.ДатаСоздания) Тогда
		Элементы.НадписьСоздан.Заголовок = "Создан: " + Строка(Объект.Автор) + " " + Строка(Объект.ДатаСоздания);
		
		Если ЗначениеЗаполнено(Объект.АвторИзменения) И ЗначениеЗаполнено(Объект.ДатаИзменения) Тогда
			Элементы.НадписьИзменен.Заголовок = "Изменён: " + Строка(Объект.АвторИзменения) + " " + Строка(Объект.ДатаИзменения);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьГиперссылкуИсторииИзменений()

	Если ЭтотОбъект.КоличествоСнимков = 0 Тогда
		Элементы.ГиперссылкаИсторияИзменений.Доступность = Ложь;
		Элементы.ГиперссылкаИсторияИзменений.Видимость   = Ложь;
		
	Иначе
		Элементы.ГиперссылкаИсторияИзменений.Доступность = Истина;
		Элементы.ГиперссылкаИсторияИзменений.Видимость   = Истина;
		
		Элементы.ГиперссылкаИсторияИзменений.Заголовок = СтрШаблон(НСтр("ru = 'История изменений (%1)'"), ЭтотОбъект.КоличествоСнимков);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьСписокВыбораУчастников()
	
	СписокВыбораУчастников = Элементы.тзНачальныеДанныеДинамическаяУчастник.СписокВыбора;
	
	СписокВыбораУчастников.Очистить();
	
	СписокУчастников = СписокУникальныхУчастников();
	
	Для Каждого ЭлУчастник Из СписокУчастников Цикл
		
		СписокВыбораУчастников.Добавить(ЭлУчастник);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СписокУникальныхУчастников()

	Возврат ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(Объект.Участники, "Участник", Истина);
	
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьНачальныеДанныеОбъектаИспользуяДанныеФормы()
	
	Объект.НачальныеДанные.Очистить();
	
	масУчастники = ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(ЭтотОбъект.тзНачальныеДанныеДинамическая, "Участник", Истина);
	
	Для Сч = 0 По масУчастники.ВГраница() Цикл
		
		масСтрокиТз = ЭтотОбъект.тзНачальныеДанныеДинамическая.НайтиСтроки(Новый Структура("Участник", масУчастники[Сч]));
		
		Для Сч_ = 0 По масСтрокиТз.ВГраница() Цикл
			
			Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
				НовСтрока = Объект.НачальныеДанные.Добавить();
				
				НовСтрока.Участник = масУчастники[Сч];
				
				НовСтрока.СтрокаНачальныхДанных = Сч_;
				
				НовСтрока.ЭлементНачальныхДанных	= масСтрокиТз[Сч_]["Характеристика" + ЭлСоо.Ключ];
				
				НовСтрока.ЗначениеНачальныхДанных	= масСтрокиТз[Сч_][ЭлСоо.Ключ];
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	
	сткТекущееСостояние = РегистрыСведений.АукИсторияСтатусовАукционов.ТекущееСостояниеАукциона(Объект.Ссылка); 
	
	ЭтотОбъект.ТекущийСтатус = сткТекущееСостояние.Статус; 
	ЭтотОбъект.ТекущийНомерЭтапа = сткТекущееСостояние.НомерЭтапа;
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		ЭтотОбъект.КоличествоСнимков = Справочники.АукАукционы.КоличествоСнимковТекущегоАукциона(Объект.Ссылка);
		
	КонецЕсли;
	
	СоздатьКолонкиНачальныхДанныхДинамическиИЗаполнить(Объект.ВидАукциона);
	
	Если ЗначениеЗаполнено(Объект.ВидАукциона) Тогда
		ЭтотОбъект.ТекущиеНастройкиВидаАукциона = Новый ФиксированнаяСтруктура(НастройкиВидаАукциона(Объект.ВидАукциона));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКолонкиНачальныхДанныхДинамическиИЗаполнить(пВидАукциона, пБулТолькоСоздатьКолонки = Ложь)
	
	ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	ОбновитьКоллекцииВспомогательныхДанных(пВидАукциона);
	
	Если ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами.Количество() <> 0 Тогда
		
		АукОбщийСервер.ДобавитьКолонкиНачальныхДанныхПоАукциону(ЭтотОбъект, пВидАукциона, "тзНачальныеДанныеДинамическая");
		
		Если Не пБулТолькоСоздатьКолонки Тогда
			
			ЗаполнитьТаблицуНачальныхДанных(Объект.Ссылка, пВидАукциона);
			
		КонецЕсли;
		
		АукОбщийКлиентСервер.ОбновитьОтборКонтактныхЛицДляВсехУчастников(Объект.Участники, пВидАукциона);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьИнтефейсПриИзмененииВидаАукционаНаСервере(Знач пТекВидАукциона, Знач пНовВидАукциона)
	
	Если ЗначениеЗаполнено(пНовВидАукциона) Тогда	
		АукОбщийСервер.УдалитьКолонкиНачальныхДанныхПоАукциону(ЭтотОбъект, пТекВидАукциона, "тзНачальныеДанныеДинамическая");
		
		СоздатьКолонкиНачальныхДанныхДинамическиИЗаполнить(пНовВидАукциона, Истина);
		
		ЗаполнитьЭтапыПоУмолчанию(пНовВидАукциона);
		
		ОбновитьТаблицуПараметров(пНовВидАукциона);
	Иначе
		
		АукОбщийСервер.УдалитьКолонкиНачальныхДанныхПоАукциону(ЭтотОбъект, пТекВидАукциона, "тзНачальныеДанныеДинамическая");
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуПараметров(пВидАукциона)
	Объект.Параметры.Очистить();
	
	Если ЗначениеЗаполнено(пВидАукциона) Тогда
		масПараметры = АукОбщийВызовСервера.ПараметрыАукционаПоВиду(пВидАукциона);
		
		Для Каждого ЭлПараметр Из масПараметры Цикл
			ЗаполнитьЗначенияСвойств(Объект.Параметры.Добавить(), ЭлПараметр);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыПоУмолчанию(пНовВидАукциона)
	
	Объект.Этапы.Очистить();
	
	Если ЗначениеЗаполнено(пНовВидАукциона) Тогда
		
		масСписокЭтапов = АукОбщийВызовСервера.СписокЭтаповПоУмолчаниюПоВидуАукциона(пНовВидАукциона);
		
		Для Каждого ЭлМас Из масСписокЭтапов Цикл
			
			ЗаполнитьЗначенияСвойств(Объект.Этапы.Добавить(), ЭлМас);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Модифицированность = Истина;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНачальныхДанных(пАукцион, пВидАукциона)
	
	Если ЗначениеЗаполнено(пВидАукциона) Тогда
		тзТемп = РеквизитФормыВЗначение("тзНачальныеДанныеДинамическая");
		
		Если ЗначениеЗаполнено(пАукцион) Тогда
			тзТекДанныеНачДанных = Справочники.АукАукционы.ЗначенияНачальныхДанных(пАукцион, пВидАукциона);
		Иначе	
			тзТекДанныеНачДанных = Справочники.АукАукционы.ЗначенияНачальныхДанныхНезаписанногоОбъекта(Объект.НачальныеДанные.Выгрузить(), пВидАукциона);
		КонецЕсли;
			
		Для Каждого СтрокаТз Из тзТекДанныеНачДанных Цикл
			
			НовСтрока = тзТемп.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТз);
			
			Для Каждого ЭлСоо Из ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами Цикл
				НовСтрока["Характеристика" + ЭлСоо.Ключ] = ЭлСоо.Значение;	
			КонецЦикла;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(тзТемп, "тзНачальныеДанныеДинамическая");		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьКоллекцииВспомогательныхДанных(пВидАукциона)
	
	Если ЗначениеЗаполнено(пВидАукциона) Тогда
		
		ОбновитьЗначениеСвязиЭлементовСтавкиСРеквизитами(пВидАукциона);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначениеСвязиЭлементовСтавкиСРеквизитами(пВидАукциона)
	
	масСтруктураНачДанных = Справочники.АукВидыАукционов.ОписаниеСтруктурыНачальныхДанныхПоВидуАукциона(пВидАукциона);
	
	сооСвязьЭлементовСтавкиСРеквизитами = Новый Соответствие;
	
	Для Каждого сткЭлемент Из масСтруктураНачДанных Цикл
		
		сооСвязьЭлементовСтавкиСРеквизитами.Вставить(сткЭлемент.ТехническоеНаименование, сткЭлемент.Элемент);
		
	КонецЦикла;
	
	ЭтотОбъект.СвязьЭлементовСтавкиСРеквизитами = Новый ФиксированноеСоответствие(сооСвязьЭлементовСтавкиСРеквизитами);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиВидаАукциона(пВидАукциона)
	Возврат Справочники.АукВидыАукционов.КлючевыеДанныеВидаАукциона(пВидАукциона);	
КонецФункции	

#КонецОбласти
